## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 11 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.karpenter-replicas-unavailable[0]`       |
|        | `aws_cloudwatch_query_definition.celery-filter-by-job[0]`             |
|        | `aws_cloudwatch_query_definition.celery-filter-by-notification-id[0]` |
|        | `aws_cloudwatch_query_definition.celery-memory-usage-by-pod[0]`       |
|        | `aws_cloudwatch_query_definition.celery-pods-over-cpu-limit[0]`       |
|        | `aws_cloudwatch_query_definition.celery-queues[0]`                    |
|        | `aws_cloudwatch_query_definition.celery-starts[0]`                    |
|        | `aws_cloudwatch_query_definition.celery-worker-exited-normally[0]`    |
|        | `aws_cloudwatch_query_definition.celery-worker-exited-prematurely[0]` |
|        | `aws_cloudwatch_query_definition.celery-worker-exits-cold-vs-warm[0]` |
|        | `aws_cloudwatch_query_definition.retry-attemps-by-duration[0]`        |
| update | `aws_cloudwatch_dashboard.notify_system[0]`                           |
|        | `aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]` |
|        | `aws_eks_node_group.notification-canada-ca-eks-node-group`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.notify_system[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "notify_system" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                  ~ {
                      ~ properties = {
                          ~ metrics   = [
                                [
                                    "ContainerInsights/Prometheus",
                                    "kube_deployment_status_replicas_available",
                                    "namespace",
                                    "notification-canada-ca",
                                    "ClusterName",
                                    "notification-canada-ca-production-eks-cluster",
                                    "deployment",
                                    "celery",
                                    {
                                        region = "ca-central-1"
                                    },
                                ],
                              - [
                                  - "...",
                                  - "celery-email-send",
                                  - {
                                      - region = "ca-central-1"
                                    },
                                ],
                                [
                                    "...",
                                    "celery-sms-send",
                                    {
                                        region = "ca-central-1"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "celery-email-send",
                                  + {
                                      + region = "ca-central-1"
                                    },
                                ],
                            ]
                            # (6 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 6
                        properties = {
                            metrics   = [
                                [
                                    "AWS/Lambda",
                                    "Invocations",
                                    "FunctionName",
                                    "api-lambda",
                                    {
                                        color  = "#b088f5"
                                        region = "ca-central-1"
                                    },
                                ],
                            ]
                            period    = 60
                            region    = "ca-central-1"
                            sparkline = true
                            stat      = "Maximum"
                            title     = "API Lambda Invocations"
                            view      = "singleValue"
                        }
                        type       = "metric"
                        width      = 3
                        x          = 0
                        y          = 36
                    },
                    # (12 unchanged elements hidden)
                    {
                        height     = 6
                        properties = {
                            metrics   = [
                                [
                                    "AWS/SQS",
                                    "ApproximateAgeOfOldestMessage",
                                    "QueueName",
                                    "eks-notification-canada-casend-sms-high",
                                    {
                                        label  = "High"
                                        region = "ca-central-1"
                                    },
                                ],
                                [
                                    "...",
                                    "eks-notification-canada-casend-sms-medium",
                                    {
                                        label  = "Medium"
                                        region = "ca-central-1"
                                    },
                                ],
                                [
                                    "...",
                                    "eks-notification-canada-casend-sms-low",
                                    {
                                        label  = "Low"
                                        region = "ca-central-1"
                                    },
                                ],
                            ]
                            period    = 60
                            region    = "ca-central-1"
                            sparkline = true
                            stacked   = false
                            stat      = "Maximum"
                            title     = "Queue delays"
                            view      = "singleValue"
                        }
                        type       = "metric"
                        width      = 9
                        x          = 8
                        y          = 10
                    },
                  ~ {
                      ~ y          = 10 -> 3
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/containerinsights/notification-canada-ca-production-eks-cluster/application' | fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
                                | filter kubernetes.container_name like /^celery/
                                | fields strcontains(@message, 'ERROR') as is_error
                                | stats sum(is_error)as errors by bin(1m)
                            EOT
                            region  = "ca-central-1"
                            stacked = false
                            title   = "Celery errors"
                            view    = "timeSeries"
                        }
                        type       = "log"
                        width      = 8
                        x          = 0
                        y          = 23
                    },
                    {
                        height     = 1
                        properties = {
                            markdown = "# Lambdas"
                        }
                        type       = "text"
                        width      = 24
                        x          = 0
                        y          = 35
                    },
                  ~ {
                      ~ properties = {
                          ~ query   = <<-EOT
                                SOURCE '/aws/containerinsights/notification-canada-ca-production-eks-cluster/application' | fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
                              - | filter kubernetes.container_name like /^celery/
                              + | filter kubernetes.container_name not like /^celery/
                                | fields @message like /HTTP\/\d+\.\d+\\" 50\d/ as is_error
                                | stats sum(is_error)as errors by bin(1m)
                            EOT
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/containerinsights/notification-canada-ca-production-eks-cluster/application' | fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
                                | filter kubernetes.container_name not like /celery/
                                | filter @message like /HTTP\/\d+\.\d+\\" 50\d/
                                | sort @timestamp desc
                                | limit 20
                            EOT
                            region  = "ca-central-1"
                            stacked = false
                            title   = "500s"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 16
                        x          = 8
                        y          = 29
                    },
                ]
            }
        )
        id             = "Notify-System-Overview"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "notification-canada-ca-eks-cluster-logs" {
        id                = "/aws/eks/notification-canada-ca-production-eks-cluster/cluster"
        name              = "/aws/eks/notification-canada-ca-production-eks-cluster/cluster"
      ~ retention_in_days = 14 -> 0
      + skip_destroy      = false
        tags              = {}
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.karpenter-replicas-unavailable[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "karpenter-replicas-unavailable" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Karpenter Replicas Unavailable"
      + alarm_name                            = "karpenter-replicas-unavailable"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "m1"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "ClusterName" = "notification-canada-ca-production-eks-cluster"
                  + "deployment"  = "karpenter"
                  + "namespace"   = "karpenter"
                }
              + metric_name = "kube_deployment_status_replicas_unavailable"
              + namespace   = "ContainerInsights/Prometheus"
              + period      = 300
              + stat        = "Minimum"
            }
        }
    }

  # aws_cloudwatch_query_definition.celery-filter-by-job[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-filter-by-job" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Filter by job"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.labels.app as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.labels.app like /^celery/
            | filter @message like /0d58e195-d6ae-4fe3-aa73-064ff106972b/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.celery-filter-by-notification-id[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-filter-by-notification-id" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Filter by notification id"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
            | filter @message like /notification_id/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.celery-memory-usage-by-pod[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-memory-usage-by-pod" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Celery Memory Usage By Pod"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream, @log, PodName, kubernetes.pod_name, pod_memory_usage
            | filter kubernetes.pod_name = "<pod-name>"
            | sort @timestamp desc
            | stats avg(pod_memory_utilization_over_pod_limit) by bin(30s)
        EOT
    }

  # aws_cloudwatch_query_definition.celery-pods-over-cpu-limit[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-pods-over-cpu-limit" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Celery Pods over CPU Limit"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream, @log, PodName, kubernetes.pod_name, pod_memory_usage
            | filter kubernetes.pod_name = "<pod-name>"
            | sort @timestamp desc
            | stats avg(pod_cpu_utilization_over_pod_limit) by bin(30s)
        EOT
    }

  # aws_cloudwatch_query_definition.celery-queues[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-queues" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Celery queues"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.labels.app as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.labels.app like /^celery/
            | filter @message like /queue for delivery/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.celery-starts[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-starts" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Celery Starts"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.labels.app as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
            | filter @message like /Notify config/
            | sort @timestamp desc
            | stats count
        EOT
    }

  # aws_cloudwatch_query_definition.celery-worker-exited-normally[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-worker-exited-normally" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Worker exited normally"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
            | filter @message like /Warm shutdown/
            | sort @timestamp desc
        EOT
    }

  # aws_cloudwatch_query_definition.celery-worker-exited-prematurely[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-worker-exited-prematurely" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Worker exited prematurely"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
            | filter @message like /Task handler raised error: WorkerLostError\('Worker exited prematurely/
            | sort @timestamp desc
        EOT
    }

  # aws_cloudwatch_query_definition.celery-worker-exits-cold-vs-warm[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-worker-exits-cold-vs-warm" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Worker exits, cold vs warm"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
            | parse "Warm shutdown" as @warm
            | parse "Worker exited prematurely" as @cold
            | filter ispresent(@warm) or ispresent(@cold)
            | stats count(@warm) as warm, count(@cold) as cold by bin(15m)
        EOT
    }

  # aws_cloudwatch_query_definition.retry-attemps-by-duration[0] will be created
  + resource "aws_cloudwatch_query_definition" "retry-attemps-by-duration" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Retry attempts by duration"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
            | filter @message like /Retry in/
            | parse @message /Retry in (?<retry_duration>\d+s)/
            | stats count() by retry_duration
        EOT
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group" {
        id              = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group"
        tags            = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (15 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 4 -> 8
          ~ max_size     = 7 -> 8
          ~ min_size     = 3 -> 8
        }

        # (1 unchanged block hidden)
    }

Plan: 11 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
